#Область ОбработчикиКомандФормы


&НаКлиенте
Процедура ЗаполнитьВыплаты(Команда)
	ЗаполнитьВыплатыНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
 Процедура ЗаполнитьВыплатыНаСервере()

 	Запрос = Новый Запрос;
 	Запрос.Текст =
 		"ВЫБРАТЬ
 		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
 		|	ЕСТЬNULL(ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток,0) КАК Сумма
 		|ИЗ
 		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки";
 	
 	РезультатЗапроса = Запрос.Выполнить();
 	
 	Если РезультатЗапроса.Пустой() Тогда
		ТекстСообщения = "Нет данных для формирования зарплатной ведомости.";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
 	
 	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
 	
 	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
 		ЗаполнитьЗначенияСвойств(Объект.Выплаты.Добавить(), ВыборкаДетальныеЗаписи);
 	КонецЦикла;

КонецПроцедуры


#КонецОбласти